In [2]:
import pandas as pd
import numpy as np

# Series

In [28]:
s = pd.Series(['Tom', 'William Rick', 'John', 'Alber@t', np.nan, '1234','SteveSmith'])
s

0             Tom
1    William Rick
2            John
3         Alber@t
4             NaN
5            1234
6      SteveSmith
dtype: object

In [29]:
s.str.lower()

0             tom
1    william rick
2            john
3         alber@t
4             NaN
5            1234
6      stevesmith
dtype: object

In [30]:
s.str.upper()

0             TOM
1    WILLIAM RICK
2            JOHN
3         ALBER@T
4             NaN
5            1234
6      STEVESMITH
dtype: object

In [31]:
s.str.len()

0     3.0
1    12.0
2     4.0
3     7.0
4     NaN
5     4.0
6    10.0
dtype: float64

In [32]:
s.str.split(' ')

0              [Tom]
1    [William, Rick]
2             [John]
3          [Alber@t]
4                NaN
5             [1234]
6       [SteveSmith]
dtype: object

In [33]:
s.str.cat(sep='_')

'Tom_William Rick_John_Alber@t_1234_SteveSmith'

In [34]:
s.str.contains(' ')

0    False
1     True
2    False
3    False
4      NaN
5    False
6    False
dtype: object

In [35]:
s.str.replace('a', '!!!')

0               Tom
1    Willi!!!m Rick
2              John
3           Alber@t
4               NaN
5              1234
6        SteveSmith
dtype: object

In [36]:
s.str.repeat(2)

0                      TomTom
1    William RickWilliam Rick
2                    JohnJohn
3              Alber@tAlber@t
4                         NaN
5                    12341234
6        SteveSmithSteveSmith
dtype: object

In [37]:
s.str.count('a')

0    0.0
1    1.0
2    0.0
3    0.0
4    NaN
5    0.0
6    0.0
dtype: float64

# DataFrame

In [39]:
df = pd.DataFrame({
    'a': pd.Series(['Tom', 'William Rick', 'John', 'Alber@t', np.nan, '1234','SteveSmith']),
    'b': pd.Series(np.random.rand(7))
})
df

              a         b
0           Tom  0.395715
1  William Rick  0.406327
2          John  0.169706
3       Alber@t  0.891739
4           NaN  0.106240
5          1234  0.268870
6    SteveSmith  0.449092

In [40]:
df['a']

0             Tom
1    William Rick
2            John
3         Alber@t
4             NaN
5            1234
6      SteveSmith
Name: a, dtype: object

In [41]:
df['a'].str.swapcase()

0             tOM
1    wILLIAM rICK
2            jOHN
3         aLBER@T
4             NaN
5            1234
6      sTEVEsMITH
Name: a, dtype: object